{
  "backend/main.mo": "Main backend actor implementing quality control system for pomegranate inspection with CRUD operations for empacadores, controladores, and control records, blob storage integration, access control, and comprehensive reporting with filtering and statistics.",
  "feature_evidence.json": "Feature evidence report documenting five performance optimization features: code splitting/lazy loading, React Query cache optimization, virtual scrolling/pagination, image optimization, and computation memoization.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing their functionality, including role-based access control, quality control forms, reporting, configuration pages, and PWA setup.",
  "frontend/index.html": "HTML entry point with comprehensive iOS PWA meta tags, multiple Apple touch icon sizes, splash screen configuration, and theme color definitions for standalone app experience.",
  "frontend/public/manifest.json": "Web app manifest defining the Rimonim quality control PWA with Spanish locale, standalone display mode, portrait orientation, and multiple icon sizes for various devices.",
  "frontend/public/service-worker.js": "Service worker implementing offline functionality with cache-first strategy for static assets, network-first for dynamic content, and separate image caching with version-based cache management.",
  "frontend/src/App.tsx": "Main application component that handles routing, authentication, role-based access control, and lazy-loads page components (RegistroControl, Reportes, Historial, ConfiguracionEmpacadores, ConfiguracionControladores, GestionUsuarios, RolesUsuarios) with React Query and Internet Identity integration.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Navigation header component that displays logo, role-based menu items (Registro, Reportes, Historial, Configuración, Usuarios, Roles), user role badge, and login/logout functionality based on authentication state.",
  "frontend/src/components/ProfileErrorScreen.tsx": "Error screen component displayed when user profile fails to load, providing logout option to retry authentication.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including quality control registration, deletion, filtering, reports, empacador/controlador management, user profiles, and role management with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light-only theme using white backgrounds, black text, and golden (#BFA76F) accents for primary elements. Includes mobile-optimized styles for touch targets and overscroll behavior.",
  "frontend/src/lib/colorEmpacador.ts": "Defines a predefined palette of 8 colors for empacadores (packers) with utility functions to retrieve color information and names by hex value.",
  "frontend/src/lib/numberToAlpha.ts": "Empty file with no content.",
  "frontend/src/lib/pdfGenerator.ts": "Generates daily quality control PDF reports with HTML/CSS styling, including statistics, defect breakdowns, and detailed control tables. Uses UTC-3 date formatting and provides print-optimized layouts.",
  "frontend/src/lib/utc3.ts": "Provides comprehensive UTC-3 timezone utilities for date/time operations, including conversions between timestamps and dates, date string formatting, and range checking functions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ConfiguracionControladores.tsx": "Page component for managing quality control inspectors (controladores) with CRUD operations, displaying active controllers in a card layout with add/edit/delete dialogs.",
  "frontend/src/pages/ConfiguracionEmpacadores.tsx": "Page component for managing packers (empacadores) with CRUD operations, color assignment from a predefined palette, and display of active packers in a card layout.",
  "frontend/src/pages/GestionUsuarios.tsx": "User management page with a form to create users (name, password, role) and a table displaying existing users with edit/delete actions. Currently uses mock data with TODO comments for backend integration.",
  "frontend/src/pages/Historial.tsx": "History page displaying a searchable/filterable table of quality control records with details like lot, packer, controller, date, samples, and defects. Includes image preview dialog and admin-only delete functionality.",
  "frontend/src/pages/Login.tsx": "Login page using Internet Identity authentication with role descriptions (admin, user, guest) and error handling. Displays branding and timezone information (UTC-3).",
  "frontend/src/pages/RegistroControl.tsx": "Quality control registration form with camera integration, image compression, and fields for lot, packer, controller, samples, weight range, and defect counts. Includes auto-generated identifiers and form validation.",
  "frontend/src/pages/Reportes.tsx": "Reports page with daily/range date filters, defect/packer/controller/weight filters, statistics cards, and bar charts showing defect distribution. Includes PDF export functionality for daily reports.",
  "frontend/src/pages/RolesUsuarios.tsx": "User roles management page displaying all users with their principals and roles (admin, user, guest). Allows admins to change user roles with pending changes tracking and batch save functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a web application with admin role management system, listing known issues (Roles tab not appearing, users unable to access app), and cataloging existing features including role assignment UI, navigation tabs, code splitting, and React Query optimizations."
}