{
  "backend/main.mo": "Main Motoko actor implementing a quality control system for pomegranates with blob storage, access control, and comprehensive data types for defects, packers, controllers, quality controls, reports, and user management with role-based permissions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend source files including components, pages, hooks, utilities, and configuration files for the Rimonim quality control PWA application.",
  "frontend/index.html": "HTML entry point with comprehensive iOS PWA meta tags, Apple touch icons in multiple sizes, splash screen configuration, golden theme color (#BFA76F), and proper viewport settings for standalone mobile experience.",
  "frontend/public/manifest.json": "Web app manifest defining PWA configuration with Rimonim branding, multiple icon sizes (60x60 to 1024x1024), Spanish language, standalone display mode, white background, and golden theme color.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and images, network-first for dynamic content, with versioned caches, offline support, and automatic cleanup of old caches on activation.",
  "frontend/src/App.tsx": "Main React application component with Internet Identity authentication, role-based access control, tab-based navigation (registro, reportes, historial, configuracion, usuarios, roles), loading states, and permission checks for view access.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with heart icon and attribution link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header component that displays navigation menu, user role badge, and authentication controls. Dynamically shows menu items (Registro, Reportes, Historial, Configuración, Usuarios, Roles) based on user role permissions.",
  "frontend/src/components/ProfileErrorScreen.tsx": "Error screen component displayed when user profile fails to load. Provides a logout button to allow users to re-authenticate.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including quality control registration, history retrieval, filtering, reports, and CRUD operations for empacadores, controladores, and user management. Handles query invalidation and cache updates after mutations.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining design tokens for a light-only theme with white backgrounds, black text, and golden accent colors. Includes mobile-optimized touch targets and responsive styles.",
  "frontend/src/lib/colorEmpacador.ts": "Utility module defining color options for empacadores (packers) with predefined color palette and helper functions to retrieve color information by value.",
  "frontend/src/lib/numberToAlpha.ts": "Empty utility file, likely intended for converting numbers to alphabetic representations.",
  "frontend/src/lib/pdfGenerator.ts": "Generates daily quality control PDF reports with statistics, defect breakdowns, and detailed control records using HTML templates and print functionality.",
  "frontend/src/lib/utc3.ts": "Provides UTC-3 timezone utilities for date/time operations including conversions between timestamps and date strings, formatting, and range checking.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ConfiguracionControladores.tsx": "Configuration page for managing quality control inspectors (controladores) with CRUD operations, dialogs for add/edit/delete, and responsive UI layout.",
  "frontend/src/pages/ConfiguracionEmpacadores.tsx": "Configuration page for managing packers (empacadores) with color assignments, CRUD operations, and predefined color palette selection.",
  "frontend/src/pages/GestionUsuarios.tsx": "User management page with role-based access control (admin/user/guest), user creation form, and user list with delete functionality (currently using mock data).",
  "frontend/src/pages/Historial.tsx": "Displays a searchable, filterable table of quality control history records with image preview dialogs and admin-only delete functionality. Includes debounced search across lot, packer, controller, date, and sample count fields.",
  "frontend/src/pages/Login.tsx": "Login page component that authenticates users via Internet Identity and displays role descriptions. Shows loading states, error alerts, and timezone information.",
  "frontend/src/pages/RegistroControl.tsx": "Quality control registration form with camera integration, image compression, defect tracking, and packer/controller selection. Validates inputs and uploads compressed images with control data.",
  "frontend/src/pages/Reportes.tsx": "Comprehensive reports page with daily/range filtering, defect statistics, charts, and PDF export functionality. Displays aggregated quality control metrics by packer, controller, and defect type.",
  "frontend/src/pages/RolesUsuarios.tsx": "Admin-only user role management page displaying all users in a table with role selection dropdowns and batch save functionality. Shows role descriptions and handles permission updates.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components (sidebar, chart, card), and animation keyframes for accordions.",
  "project_state.json": "Project state tracking file documenting a web application with admin role management system, currently experiencing critical issues where version 109 shows 'Acceso Denegado' errors and the Roles navigation tab is not appearing despite multiple implementation attempts. Contains feature tracking, known issues, architectural notes, and version history showing reversion from buggy versions 106-108 to stable version 99."
}