{
  "backend/main.mo": "Main backend actor implementing quality control system for pomegranates with defect tracking, packer/controller management, access control with three user roles (guest/user/admin), photo storage via blob-storage mixin, and comprehensive reporting with filtering and statistics.",
  "backend/migration.mo": "Migration module with placeholder structure for future actor state migrations between versions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, pages, hooks, and configuration files for the Rimonim quality control PWA application.",
  "frontend/index.html": "HTML entry point with comprehensive iOS PWA meta tags, Apple touch icons in multiple sizes, splash screen configuration, and golden theme color (#BFA76F) for the Rimonim quality control application.",
  "frontend/public/manifest.json": "PWA manifest defining Rimonim app configuration with Spanish language, standalone display mode, golden theme color, and iOS-optimized icons in sizes from 60x60 to 1024x1024.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for dynamic content, separate image cache, and automatic cleanup of old cache versions with iOS compatibility considerations.",
  "frontend/src/App.tsx": "Main React application component with Internet Identity authentication, role-based access control (guest/user/admin), view routing with permission checks, and loading states for actor initialization.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and caffeine.ai attribution link with heart icon.",
  "frontend/src/components/Header.tsx": "Header component with navigation menu, role-based access control, and user authentication display. Includes mobile responsive menu with sheet drawer and logout functionality.",
  "frontend/src/components/ProfileErrorScreen.tsx": "Error screen component displayed when user profile fails to load. Provides logout button to allow re-authentication.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow and identity state. Provides AuthClient wrapper with configurable options and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including control registration, deletion, filtering, reports, and user/role management. Handles query invalidation and refetching on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a light-only theme with golden accents, white backgrounds, and mobile-optimized touch targets. Disables dark mode and pull-to-refresh.",
  "frontend/src/lib/colorEmpacador.ts": "Utility module defining color options for packer identification with predefined palette and helper functions to retrieve color info by value.",
  "frontend/src/lib/numberToAlpha.ts": "Empty utility file, likely intended for number-to-alphabetic conversion functions.",
  "frontend/src/lib/pdfGenerator.ts": "Generates daily quality control PDF reports with statistics, defect breakdowns, and control details using HTML templates and print functionality.",
  "frontend/src/lib/utc3.ts": "Provides UTC-3 timezone utilities for date/time operations including conversions between timestamps and date strings, formatting, and range checking.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ConfiguracionControladores.tsx": "Page component for managing quality control inspectors (controladores) with CRUD operations, dialogs for add/edit/delete, and responsive layout.",
  "frontend/src/pages/ConfiguracionEmpacadores.tsx": "Page component for managing packers (empacadores) with color-coded identifiers, CRUD operations, and predefined color palette selection.",
  "frontend/src/pages/GestionUsuarios.tsx": "User management page with role-based access control (admin/user/guest), user creation form, and delete functionality with confirmation dialogs.",
  "frontend/src/pages/Historial.tsx": "Displays a filterable history of quality control records with search, defect filters, date ranges, and delete functionality (admin only). Shows control details including empacador, controlador, defects, weight range, and photos in a card grid layout.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, displays role descriptions (admin, user, guest), and shows error messages. Includes branding with Granada icon and system information.",
  "frontend/src/pages/RegistroControl.tsx": "Quality control registration form for recording defects (raset, cracking, golpe de sol, podredumbre), sample counts, empacador/controlador selection, weight range compliance, and photo upload. Includes validation, progress tracking, and auto-refreshing identifier.",
  "frontend/src/pages/Reportes.tsx": "Reports page with daily and date-range views, filterable by defect type, empacador, controlador, and weight range. Displays statistics, charts (defects by empacador/controlador), and generates downloadable PDF reports.",
  "frontend/src/pages/RolesUsuarios.tsx": "User role management page (admin only) that displays all users with their principals and allows batch role assignment (admin, user, guest) with descriptions of each role's permissions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for UI components (borders, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a web application with admin user role management system. Contains one completed feature for role assignment UI backend integration and six pending feature requests for adding a Roles navigation tab, role assignment interface, routing updates, and admin user configuration."
}